Tekla.Structures.Filtering.StringFilterExpression
The StringFilterExpression class represents a string filter expression.

Tekla.Structures.Filtering.StringFilterExpression.#ctor(System.String)
Initializes a new instance of the StringFilterExpression class.
Key: The value to represent.

Tekla.Structures.Filtering.StringFilterExpression.#ctor(System.String,System.String,System.String,System.String)
Initializes a new instance of the StringFilterExpression class.
Name: The name of the expression.
Category: The category of the expression.
Property: The property of the expression.
LocalizationKey: The localization key of the expression.